In [5]:
import pandas as pd

In [7]:
pd.read_csv("DATA2.csv")

  Name Department  Wages
0  Ram  Marketing    500
1  Ram  Marketing    700
2  Ram  Marketing   1200
3  Ram  Marketing    300
4  Ram  Marketing    500
5  Ram  Marketing    200

In [6]:
cd  C:\Users\user\Documents

C:\Users\user\Documents

In [8]:
df = pd.read_csv("DATA2.csv")

In [10]:
print(df)

  Name Department  Wages
0  Ram  Marketing    500
1  Ram  Marketing    700
2  Ram  Marketing   1200
3  Ram  Marketing    300
4  Ram  Marketing    500
5  Ram  Marketing    200

In [11]:
df['CUMSUM_C'] = df['Wages'].cumsum()

In [12]:
df

  Name Department  Wages  CUMSUM_C
0  Ram  Marketing    500       500
1  Ram  Marketing    700      1200
2  Ram  Marketing   1200      2400
3  Ram  Marketing    300      2700
4  Ram  Marketing    500      3200
5  Ram  Marketing    200      3400